{
    "header": {
        "name": "Oscar Soccol",
        "job": "Web Developer",
        "line1": "Dedicated to",
        "link1": "good web practices",
        "line2": "Acting for",
        "link2": "sustainable digital technology",
        "colors": "Contrasted colors",
        "lang": "Language",
        "audio": "Audio description"
    },
    "technos": {
        "title": "Technologies",
        "tech1": "TypeScript",
        "fram1": "Angular",
        "content1_0": "Open-source language built on the most widely used language on the Web: JavaScript.",
        "content1_1": "Angular enables the creation of web applications that makes the UX more fluid thanks to excellent data and event management.",
        "tech2": "Java",
        "fram2": "Spring",
        "content2_0": "Since 1995 Java is everywhere and has influenced a large amount of languages. By mastering Java I am able to program in any object oriented language.",
        "content2_1": "Spring framework is perfect to lighten the Java code, especially to configure environments and manage data.",
        "tech3": "Bootstrap",
        "fram3": "",
        "content3_0": "Extremely popular in recent years in the developer community, Bootstrap saves coding time on the visual aspect.",
        "content3_1": "I've been using it for over a year, it suits perfectly JavaScript. Associated with Angular it makes the code lighter which facilitates the reading and the maintainability of the components."
    },
    "experiences": {
        "title": "Experiences",
        "company1": {
            "name" : "ELIS",
            "mission": "GLAD - Global Logistics Assistance for Deliveries",
            "content": "Development of a global application deployed in 27 countries. Creation of a driver guidance app as well as a web-based solution for tracking and optimizing delivery routes. The technical environment was composed of a micro-services architecture deployed on Microsoft's AZURE Cloud, a Postgres database processing 3M requests/day, a cartographic monitoring via the HereMaps API, among other technologies...",
            "comment": {
                "name": "",
                "job": "",
                "content": ""
            }
        },
        "company2": {
            "name" : "HN Services",
            "mission": "",
            "content": "2 years of collaboration with the HN Group to which I owe my success. I was recruited after my studies in engineering then I was trained internally for 6 months in new technologies around Java. I learned the technical aspect of the job of developer and I was able to participate in the implementation of a large-scale project, from the drafting of the technical and functional specifications to the delivery of the solution. The projects conducted with the company allowed me to improve my skills and apply my knowledges. I've been very happy during this experience thanks to the teams who trusted me.",
            "comment": {
                "name": "Stéphane S.",
                "job": "Projects Director",
                "content": "Oscar took part for 15 months in a large-scale technical and functional project. He invested heavily in learning new technologies that he quickly mastered. He was able to acquire a solid technical base, participate in a project from scratch, follow the appropriate methodology, bringing values ​​and empathy."
            }
        }
    },
    "practices": {
        "title": "Good Practices",
        "subject1": "Code Standards",
        "content1": "Writing and maintaining a code standards file are fundamental for sharing code with a team or for next developers.",
        "subject2": "Code Review",
        "content2": "1 h/week of code review is enough to identify on average 65% of persistent faults.",
        "subject3": "Automatized Tests Strategy",
        "content3": "TDD or BDD, the important thing is to have a testing strategy that fully covers your code. This improves the quality of the code and its maintainability."
    },
    "responsible": {
        "title": "Green IT",
        "content1": "It aims to reduce the ecological and social footprint of information technologies.",
        "content2": "10% of the electricity produced in the world is consumed by digital technology. In this age of streaming, automatic emails and data collection, we need to act to limit its impact." ,
        "content3": "This will require a change in mentalities and a reorganization of digital services which will tend to be more sober and more accessible.",
        "content4": "Digital technology also has economic and political impacts, discover more by clicking the link below.",
        "button": "Read More"
    },
    "contact": {
        "title": "Contact Me For",
        "line1": "Better code solutions",
        "line2": "Original challenges",
        "line3": "Exciting proposals",
        "email": "oscar.soccol@gmail.com",
        "phone": "06.47.02.29.80",
        "linkedIn": "LinkedIn"
    },
    "audio": {
        "message": "Your browser does not support the audio element."
    }
}